#ifndef UNICODE_H
#define UNICODE_H

#include <string>

// http://pascal.toom.su/866
const char* CP850_TO_UTF8[] = {
        " ", "☺", "☻", "♥", "♦", "♣", "♠", "•", "◘", "\x09", "\x0a", "♂", "♀", "\x0d", "♫", "☼",
        "►", "◄", "↕", "‼", "¶", "§", "▬", "↨", "↑", "↓", "→", "←", "∟", "↔", "▲", "▼",
        " ", "!", "\"", "#", "$", "%", "&", "'", "(", ")", "*", "+", ",", "-", ".", "/",
        "0", "1", "2", "3", "4", "5", "6", "7", "8", "9", ":", ";", "<", "=", ">", "?",
        "@", "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O",
        "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z", "[", "\\", "]", "^", "_",
        "`", "a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o",
        "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z", "{", "|", "}", "~", "⌂",
        "Ç", "ü", "é", "â", "ä", "à", "å", "ç", "ê", "ë", "è", "ï", "î", "ì", "Ä", "Å",
        "É", "æ", "Æ", "ô", "ö", "ò", "û", "ù", "ÿ", "Ö", "Ü", "ø", "£", "Ø", "×", "ƒ",
        "á", "í", "ó", "ú", "ñ", "Ñ", "ª", "º", "¿", "®", "¬", "½", "¼", "¡", "«", "»",
        "░", "▒", "▓", "│", "┤", "Á", "Â", "À", "©", "╣", "║", "╗", "╝", "¢", "¥", "┐",
        "└", "┴", "┬", "├", "─", "┼", "ã", "Ã", "╚", "╔", "╩", "╦", "╠", "═", "╬", "¤",
        "ð", "Ð", "Ê", "Ë", "È", "ı", "Í", "Î", "Ï", "┘", "┌", "█", "▄", "¦", "Ì", "▀",
        "Ó", "ß", "Ô", "Ò", "õ", "Õ", "µ", "þ", "Þ", "Ú", "Û", "Ù", "ý", "Ý", "¯", "´",
        "≡", "±", "‗", "¾", "¶", "§", "÷", "¸", "°", "¨", "·", "¹", "³", "²", "■", " ",
};

/*
const char* CP850_TO_JSON[] = {
        " ", "\\u0001", "\\u0002", "\\u0003", "\\u0004", "\\u0005", "\\u0006", "•", "\\u0008", "\\u0009", "\\u000a", "♂", "♀", "\\u000d", "\\u000e", "☼",
        "\\u0010", "\\u0011", "\\u0012", "‼", "\\u0014", "\\u0015", "\\u0016", "\\u0017", "\\u0018", "\\u0019", "\\u001a", "\\u001b", "\\u001c", "\\u001d", "▲", "▼",
        " ", "!", "\\\\\"", "#", "$", "%", "&", "'", "(", ")", "*", "+", ",", "-", ".", "/",
        "0", "1", "2", "3", "4", "5", "6", "7", "8", "9", ":", ";", "<", "=", ">", "?",
        "@", "A", "B", "C", "D", "E", "F", "G", "H", "I", "J", "K", "L", "M", "N", "O",
        "P", "Q", "R", "S", "T", "U", "V", "W", "X", "Y", "Z", "[", "\\\\\\", "]", "^", "_",
        "`", "a", "b", "c", "d", "e", "f", "g", "h", "i", "j", "k", "l", "m", "n", "o",
        "p", "q", "r", "s", "t", "u", "v", "w", "x", "y", "z", "{", "|", "}", "~", "\\u007f",
        "Ç", "ü", "é", "â", "ä", "à", "å", "ç", "ê", "ë", "è", "ï", "î", "ì", "Ä", "Å",
        "É", "æ", "Æ", "ô", "ö", "ò", "û", "ù", "ÿ", "Ö", "Ü", "ø", "£", "Ø", "×", "ƒ",
        "á", "í", "ó", "ú", "ñ", "Ñ", "ª", "º", "¿", "®", "¬", "½", "¼", "¡", "«", "»",
        "░", "▒", "▓", "│", "┤", "Á", "Â", "À", "©", "╣", "║", "╗", "╝", "¢", "¥", "┐",
        "└", "┴", "┬", "├", "─", "┼", "ã", "Ã", "╚", "╔", "╩", "╦", "╠", "═", "╬", "¤",
        "ð", "Ð", "Ê", "Ë", "È", "ı", "Í", "Î", "Ï", "┘", "┌", "█", "▄", "¦", "Ì", "▀",
        "Ó", "ß", "Ô", "Ò", "õ", "Õ", "µ", "þ", "Þ", "Ú", "Û", "Ù", "ý", "Ý", "¯", "´",
        "≡", "±", "‗", "¾", "¶", "§", "÷", "¸", "°", "¨", "·", "¹", "³", "²", "■", " ",
};
*/

using namespace std;

string cp850_to_utf8(string src){
    string dst;
    const char*c;
    int l=src.size();
    dst.reserve(l + l/10);
    const unsigned char*p = (const unsigned char*) src.data();

    for(int i=0;i<l;i++){
        dst += CP850_TO_UTF8[p[i]];
    }
    return dst;
}

/*
string cp850_to_json(string src){
    string dst;
    const char*c;
    int l=src.size();
    dst.reserve(l + l/10);
    const unsigned char*p = (const unsigned char*) src.data();

    for(int i=0;i<l;i++){
        dst += CP850_TO_JSON[p[i]];
    }
    return dst;
}
*/

string url_escape(string src){
    string dst;
    const char*c;
    int l=src.size();
    dst.reserve(l + l/10);
    const unsigned char*p = (const unsigned char*) src.data();

    for(int i=0;i<l;i++){
        switch(p[i]){
            case ' ':
                dst += "+";
                break;
            default:
                dst += p[i];
                break;
        }
    }
    return dst;
}

string html_escape(string src){
    string dst;
    const char*c;
    int l=src.size();
    dst.reserve(l + l/10);
    const unsigned char*p = (const unsigned char*) src.data();

    for(int i=0;i<l;i++){
        switch(p[i]){
            case '<':
                dst += "&lt;";
                break;
            case '>':
                dst += "&gt;";
                break;
            case '&':
                dst += "&amp;";
                break;
            default:
                dst += p[i];
                break;
        }
    }
    return dst;
}

#endif
